function game() {
    let surak;
    while (surak != 24) {
        surak = prompt("Жасырынған санды табыңыз (1 мен 100-дің аралығында):");
        if (surak < 24) {
            alert("Жасырынған сан сіз енгізген саннан үлкен!");
        } else if (surak > 24) {
            alert("Жасырынған сан сіз енгізген саннын кіші!");
        } else if (surak == "24") {
            alert("Сіз жасырынған санды дұрыс таптыңыз, құттықтаймыз!");
            break;
        } else {
            alert("Сіз дұрыс емес сан енгіздіңіз! Сан тек 1 мен 100-дің аралығында жасырынған!")
        }
    }
}
alert(game());